In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
l=[89,45,65,78,41]
s=pd.Series(l)
print(s)

0    89
1    45
2    65
3    78
4    41
dtype: int64

In [4]:
l=[89,45,65,78,41]
s=pd.Series(l,index=['a','b','c','d','e'])
print(s)

a    89
b    45
c    65
d    78
e    41
dtype: int64

In [5]:
print(pd.__version__)

2.1.2

In [6]:
tup=(78,89,52,46,12)
s=pd.Series(tup)
print(s)

0    78
1    89
2    52
3    46
4    12
dtype: int64

In [7]:
tup=(78,89,52,46,12)
s=pd.Series(tup,index=[1,2,3,4,5])
print(s)

1    78
2    89
3    52
4    46
5    12
dtype: int64

In [8]:
p=np.arange(10,20)
q=pd.Series(p,index=[1,2,3,4,5,6,7,8,9,10])
print(q)

1     10
2     11
3     12
4     13
5     14
6     15
7     16
8     17
9     18
10    19
dtype: int32

Accessing series values

In [9]:
q.info()

<class 'pandas.core.series.Series'>
Index: 10 entries, 1 to 10
Series name: None
Non-Null Count  Dtype
--------------  -----
10 non-null     int32
dtypes: int32(1)
memory usage: 120.0 bytes

In [10]:
p=np.arange(10,20)
q=pd.Series(p,index=['a','b','c','d','e','f','g','h','i','j'])
print(q)

a    10
b    11
c    12
d    13
e    14
f    15
g    16
h    17
i    18
j    19
dtype: int32

In [11]:
d={'a':45,'b':89,'c':100}
d2=pd.Series(d)
print(d2)

a     45
b     89
c    100
dtype: int64

In [12]:
print(d2)

a     45
b     89
c    100
dtype: int64

In [13]:
d2[2]

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22684\2956578697.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  d2[2]

100

Que 1 write a pandas program to add,subtract,multiple and divide two pandas series

In [14]:
d={'a':45,'b':89,'c':100}
d2=pd.Series(d)
print(d2)
print("-----------------------------------------------------")
d={'a':89,'b':112,'c':185}
d3=pd.Series(d)
print(d3)

a     45
b     89
c    100
dtype: int64
-----------------------------------------------------
a     89
b    112
c    185
dtype: int64

In [15]:
print(d2.add(d3))

a    134
b    201
c    285
dtype: int64

In [16]:
print(d2.sub(d3))

a   -44
b   -23
c   -85
dtype: int64

In [17]:
print(d2.mul(d3))

a     4005
b     9968
c    18500
dtype: int64

In [18]:
print(d2.div(d3))

a    0.505618
b    0.794643
c    0.540541
dtype: float64

In [19]:
print(d2//d3)

a    0
b    0
c    0
dtype: int64

In [20]:
print(d3%d2)

a    44
b    23
c    85
dtype: int64

write aprogram to convert the dictonary into pandas series

In [21]:
d={'a':45,'b':89,'c':100}
d2=pd.Series(d)
print(d2)

a     45
b     89
c    100
dtype: int64

write aprogram to convert a numpy array to a pandas series

In [22]:
d=np.arange(10,30)
d3=pd.Series(d)
print(d3)

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
dtype: int32

write a pandas program to create a subset of a given based on a value and condition

In [23]:
arr=np.arange(0,11)
d4=pd.Series(arr)
print(d4)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int32

In [24]:
#subset of the above data series 

d4[:6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int32

In [25]:
d4.iloc[:6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int32

In [26]:
d=np.arange(10,30)
d3=pd.Series(d)
print(d3)
print("----------------------------------------------------------------------")

print("min value is ",min(d3))

print("-----------------------------------------------------------------")
print("max value is ",max(d3))

print("------------------------------------------------------")

print("sum is",sum(d3))

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
dtype: int32
----------------------------------------------------------------------
min value is  10
-----------------------------------------------------------------
max value is  29
------------------------------------------------------
sum is 390

DATAFRAME

que-1 sample python dict. data and list labels

In [27]:
exam_data={'name':['Sonu','Raja','Ketaki','Rupa','Radha','Reshma','Keshav','Narendra','Rani','Kittu'],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}
labels=['a','b','c','d','e','f','g','h','i','j']

d=pd.DataFrame(exam_data,labels)
print(d)

       name qualify  score
a      Sonu     yes   12.5
b      Raja      no    9.0
c    Ketaki     yes   16.5
d      Rupa      no    NaN
e     Radha      no    9.0
f    Reshma     yes   20.0
g    Keshav     yes   14.5
h  Narendra      no    NaN
i      Rani      no    8.0
j     Kittu     yes   19.0

Question 2

In [28]:
d.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     10 non-null     object
 1   qualify  10 non-null     object
 2   score    8 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

Question3

In [29]:
d.head(3)

     name qualify  score
a    Sonu     yes   12.5
b    Raja      no    9.0
c  Ketaki     yes   16.5

Question4

In [30]:
d[["name","score"]]

       name  score
a      Sonu   12.5
b      Raja    9.0
c    Ketaki   16.5
d      Rupa    NaN
e     Radha    9.0
f    Reshma   20.0
g    Keshav   14.5
h  Narendra    NaN
i      Rani    8.0
j     Kittu   19.0

Question 5

In [31]:
d={"col1":[1,2,3],"col2":[4,5,6],"col3":[7,8,9]}
d1=pd.DataFrame(d)
print(d1)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [32]:
d1.columns=["column1","column2","columns3"]
d1

   column1  column2  columns3
0        1        4         7
1        2        5         8
2        3        6         9

In [33]:
d1.rename(columns={"column2":"col2"})

   column1  col2  columns3
0        1     4         7
1        2     5         8
2        3     6         9

Question6

In [34]:
exam_data={'name':['Sonu','Raja','Ketaki','Rupa','Radha','Reshma','Keshav','Narendra','Rani','Kittu'],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes'],"attempts":[1,3,2,3,2,3,1,1,2,1]}
labels=['a','b','c','d','e','f','g','h','i','j']

d=pd.DataFrame(exam_data,labels)
#print(d)

print(d.iloc[[1,3,5,6],[0,1]])

     name qualify
b    Raja      no
d    Rupa      no
f  Reshma     yes
g  Keshav     yes

Question7

In [35]:
d[d["attempts"]>2]

     name qualify  score  attempts
b    Raja      no    9.0         3
d    Rupa      no    NaN         3
f  Reshma     yes   20.0         3

In [37]:
#question8

d.shape

(10, 4)

In [42]:
print(d.shape[0])
print(d.shape[1])

10
4

In [44]:
#question9 
d[d["score"].isna()==True]

       name qualify  score  attempts
d      Rupa      no    NaN         3
h  Narendra      no    NaN         1

In [52]:
#question10

d[(d["score"]>14) & (d["score"]<21)]
#d["score"].dtype

     name qualify  score  attempts
c  Ketaki     yes   16.5         2
f  Reshma     yes   20.0         3
g  Keshav     yes   14.5         1
j   Kittu     yes   19.0         1

In [55]:
#question 11
d[(d["attempts"]<2) & (d["score"]>15)]

    name qualify  score  attempts
j  Kittu     yes   19.0         1

In [58]:
#question12 
d["attempts"].sum()

19

In [61]:
#question 13 
d["score"].mean()

13.5625

In [73]:
#question 14 
d.loc["k"]=["Riya","yes",52.00,1]

In [74]:
d

       name qualify  score  attempts
a      Sonu     yes   12.5         1
b      Raja      no    9.0         3
c    Ketaki     yes   16.5         2
d      Rupa      no    NaN         3
e     Radha      no    9.0         2
f    Reshma     yes   20.0         3
g    Keshav     yes   14.5         1
h  Narendra      no    NaN         1
i      Rani      no    8.0         2
j     Kittu     yes   19.0         1
k      Riya     yes   52.0         1

In [ ]:
#question 18

In [86]:
d["newColumn"]=100

In [87]:
d

       name qualify  score  newColumn
a      Sonu     yes   12.5        100
b      Raja      no    9.0        100
c    Ketaki     yes   16.5        100
d      Rupa      no    NaN        100
e     Radha      no    9.0        100
f    Reshma     yes   20.0        100
g    Keshav     yes   14.5        100
h  Narendra      no    NaN        100
i      Rani      no    8.0        100
j     Kittu     yes   19.0        100
k      Riya     yes   52.0        100

In [ ]:
#question15

In [88]:
d.sort_values(["name","score"],ascending=[False,True])

       name qualify  score  newColumn
a      Sonu     yes   12.5        100
d      Rupa      no    NaN        100
k      Riya     yes   52.0        100
f    Reshma     yes   20.0        100
i      Rani      no    8.0        100
b      Raja      no    9.0        100
e     Radha      no    9.0        100
h  Narendra      no    NaN        100
j     Kittu     yes   19.0        100
c    Ketaki     yes   16.5        100
g    Keshav     yes   14.5        100

In [ ]:
#question17

In [84]:
d.drop(columns="attempts",inplace=True) 
# inplace = true that will modify current df by default it is False so it will return new df
d

       name qualify  score
a      Sonu     yes   12.5
b      Raja      no    9.0
c    Ketaki     yes   16.5
d      Rupa      no    NaN
e     Radha      no    9.0
f    Reshma     yes   20.0
g    Keshav     yes   14.5
h  Narendra      no    NaN
i      Rani      no    8.0
j     Kittu     yes   19.0
k      Riya     yes   52.0

In [89]:
#question16
d["qualify"].replace({'yes':'True',"no":'False'},inplace=True)  #on Series/Single column
d

       name qualify  score  newColumn
a      Sonu    True   12.5        100
b      Raja   False    9.0        100
c    Ketaki    True   16.5        100
d      Rupa   False    NaN        100
e     Radha   False    9.0        100
f    Reshma    True   20.0        100
g    Keshav    True   14.5        100
h  Narendra   False    NaN        100
i      Rani   False    8.0        100
j     Kittu    True   19.0        100
k      Riya    True   52.0        100